0/Ue
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ue;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    atmosphere
    {
        type            zeroGradient;
    }
    downWall
    {
        type            uniformFixedValue;
        uniformValue
        {
            type        sine;
            frequency   12.5;
            amplitude   12000;
            scale       1;
            level       1;
        }
    }
    upWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    axis
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
