system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
 
    root            "";
    case            "";
    instance        "";
    local           "";
 
    class           dictionary;
    object          blockMeshDict;
}
 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
convertToMeters 1;
 
vertices
(
(0 0 0)                     //0
(0 -0.0004 0)                 //1
(0 -0.0008 0)                 //2
(0 -0.0012 0)                  //3 
(0.0002 -0.0012 0)     //4 
(0.0002 -0.0008 0)    //5 
(0.0002 -0.0004 0)    //6
(0.0002 0 0)        //7
(0.0006 0 0)        //8
(0.0006 -0.0004 0)    //9    
(0.0006 -0.0008 0)    //10
(0.0006 -0.0012 0)     //11
(0.0002 0 -0.0001)       //12
(0.0002 -0.0004 -0.0001)   //13
(0.0002 -0.0008 -0.0001)   //14
(0.0002 -0.0012 -0.0001)    //15
(0.0006 -0.0012 -0.0001)    //16
(0.0006 -0.0008 -0.0001)   //17
(0.0006 -0.0004 -0.0001)   //18
(0.0006 0 -0.0001)       //19
(0 0 -0.0001)//20
(0 -0.0004 -0.0001)//21
(0 -0.0008 -0.0001)//22
(0 -0.0012 -0.0001)//23
);
 
blocks
(
hex (20 12 7 0 21 13 6 1)      (45 1 45)  simpleGrading (1 1 0.1)
hex (21 13 6 1 22 14 5 2)      (45 1 90) simpleGrading (1 1 1)
hex (22 14 5 2 23 15 4 3)      (45 1 45)  simpleGrading (1 1 10)
hex (12 19 8 7 13 18 9 6)    (45 1 45)  simpleGrading (10 1 0.1)
hex (13 18 9 6 14 17 10 5)   (45 1 90) simpleGrading (10 1 1)
hex (14 17 10 5 15 16 11 4)  (45 1 45)  simpleGrading (10 1 10)
);
 
edges
(
);
 
boundary
(
    front
    {
        type empty;
        faces
        ( 
             (0 1 6 7)
             (1 2 5 6)
             (2 3 4 5)
             (7 6 9 8)
             (6 5 10 9)
             (5 4 11 10)
        );
    }
    back
    {
        type empty;
        faces
        ( 
             (20 21 13 12)
             (21 22 14 13)
             (22 23 15 14)
             (12 13 18 19)
             (13 14 17 18)
             (14 15 16 17)
        );
    }
    atmosphere
    {
        type patch;
        faces
        ( 
             (8 9 18 19)
             (9 10 17 18)
             (10 11 16 17)
        );
    }
    downWall
    {
        type wall;
        faces
        ( 
             (3 4 15 23)
             (4 11 16 15)
        );
    }
    upWall
    {
        type wall;
        faces
        ( 
             (0 7 12 20)
             (7 8 19 12)
        );
    }
    axis
    {
        type symmetryPlane;
        faces
        ( 
             (0 1 21 20)
             (1 2 22 21)
             (2 3 23 22)
        );
    }
);
 
mergePatchPairs
(
);
